[{"name":" Adam Sandler","imgUrl":"https://m.media-amazon.com/images/M/MV5BMjQyNzM2MjM1Ml5BMl5BanBnXkFtZTcwMDE5NjI3Mg@@._V1_UY209_CR5,0,140,209_AL_.jpg","summary":"Adam Richard Sandler was born September 9, 1966 in Brooklyn, New York, to Judith (Levine), a teacher at a nursery school, and Stanley Alan Sandler, an electrical engineer. He is of Russian Jewish descent. At 17, he took his first step towards becoming a stand-up comedian when he spontaneously took ...                ","link":"https://www.imdb.com/name/nm0001191?ref_=nmls_hd"},{"name":" Will Ferrell","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTMxMDIzMDEzNF5BMl5BanBnXkFtZTcwODcxMjE2Mg@@._V1_UY209_CR2,0,140,209_AL_.jpg","summary":"John William Ferrell was born in Irvine, California, to Betty Kay (Overman), a teacher, and Roy Lee Ferrell, Jr., a musician. His parents were originally from Roanoke Rapids, North Carolina.A graduate of the University of Southern California, Ferrell became interested in performing while a student ...                ","link":"https://www.imdb.com/name/nm0002071?ref_=nmls_hd"},{"name":" Jim Carrey","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTQwMjAwNzI0M15BMl5BanBnXkFtZTcwOTY1MTMyOQ@@._V1_UY209_CR15,0,140,209_AL_.jpg","summary":"Jim Carrey, Canadian-born and a U.S. citizen since 2004, is an actor and producer famous for his rubbery body movements and flexible facial expressions. The two-time Golden Globe-winner rose to fame as a cast member of the Fox sketch comedy In Living Color (1990) but leading roles in Ace Ventura: ...                ","link":"https://www.imdb.com/name/nm0000120?ref_=nmls_hd"},{"name":" Ben Stiller","imgUrl":"https://m.media-amazon.com/images/M/MV5BMjc4NDc3NDkzMl5BMl5BanBnXkFtZTcwMTAyNTQwMw@@._V1_UY209_CR9,0,140,209_AL_.jpg","summary":"Benjamin Edward Meara Stiller was born on November 30, 1965, in New York City, New York, to legendary comedians Jerry Stiller and Anne Meara. His father was of Austrian Jewish and Polish Jewish descent, and his mother was of Irish Catholic descent (she converted to Judaism).His parents made no real...                ","link":"https://www.imdb.com/name/nm0001774?ref_=nmls_hd"},{"name":" Robin Williams","imgUrl":"https://m.media-amazon.com/images/M/MV5BNTYzMjc2Mjg4MF5BMl5BanBnXkFtZTcwODc1OTQwNw@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Robin McLaurin Williams was born on Saturday, July 21st, 1951, in Chicago, Illinois, a great-great-grandson of Mississippi Governor and Senator, Anselm J. McLaurin. His mother, Laurie McLaurin (née Janin), was a former model from Mississippi, and his father, Robert Fitzgerald Williams, was a Ford ...                ","link":"https://www.imdb.com/name/nm0000245?ref_=nmls_hd"},{"name":" Zach Galifianakis","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTQwNzI3NjIwMV5BMl5BanBnXkFtZTcwMzA1OTIwMw@@._V1_UY209_CR1,0,140,209_AL_.jpg","summary":"Zach Galifianakis was born in Wilkesboro, North Carolina, to Mary Frances (Cashion), who owned a community arts center, and Harry Galifianakis, a heating oil vendor. His father is of Greek descent and his mother is of mostly English and Scottish ancestry. Zach moved to New York City after failing ...                ","link":"https://www.imdb.com/name/nm0302108?ref_=nmls_hd"},{"name":" Eddie Murphy","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTc0NDQzODAwNF5BMl5BanBnXkFtZTYwMzUzNTk3._V1_UY209_CR4,0,140,209_AL_.jpg","summary":"Edward Regan Murphy was born April 3, 1961 in Brooklyn, New York, to Lillian Lynch (born: Lillian Laney), a telephone operator, and Charles Edward Murphy, a transit police officer who was also an amateur comedian and actor. After his father died, his mother married Vernon Lynch, a foreman at a ...                ","link":"https://www.imdb.com/name/nm0000552?ref_=nmls_hd"},{"name":" John Cleese","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTQ1MTIzMzM1MF5BMl5BanBnXkFtZTYwNjQ3ODI1._V1_UY209_CR8,0,140,209_AL_.jpg","summary":"John Cleese was born on October 27, 1939, in Weston-Super-Mare, England, to Muriel Evelyn (Cross) and Reginald Francis Cleese. He was born into a family of modest means, his father being an insurance salesman; but he was nonetheless sent off to private schools to obtain a good education. Here he ...                ","link":"https://www.imdb.com/name/nm0000092?ref_=nmls_hd"},{"name":" Steve Carell","imgUrl":"https://m.media-amazon.com/images/M/MV5BMjMyOTM2OTk1Ml5BMl5BanBnXkFtZTgwMTI3MzkyNjM@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Steve Carell, one of America's most versatile comics, was born Steven John Carell on August 16, 1962, in Concord, Massachusetts. He is the son of Harriet Theresa (Koch), a psychiatric nurse, and Edwin A. Carell, an electrical engineer. His mother was of Polish descent and his father of Italian and ...                ","link":"https://www.imdb.com/name/nm0136797?ref_=nmls_hd"},{"name":" Simon Pegg","imgUrl":"https://m.media-amazon.com/images/M/MV5BNzMwODE1NjA3OV5BMl5BanBnXkFtZTgwNTY5MzM2OTE@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"English actor, writer and comedian Simon Pegg was born Simon John Beckingham in Brockworth, Gloucestershire, to Gillian Rosemary (Smith), a civil servant, and John Henry Beckingham, a jazz musician. His parents divorced when Pegg was seven. He later took his stepfather's surname, \"Pegg\". He was ...                ","link":"https://www.imdb.com/name/nm0670408?ref_=nmls_hd"},{"name":" Jonah Hill","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTUyNDU0NzAwNl5BMl5BanBnXkFtZTcwMzQxMzIzNw@@._V1_UY209_CR19,0,140,209_AL_.jpg","summary":"Jonah Hill was born and raised in Los Angeles, the son of Sharon Feldstein (née Chalkin), a fashion designer and costume stylist, and Richard Feldstein, a tour accountant for Guns N' Roses. He is the brother of music manager Jordan Feldstein and actress Beanie Feldstein. He graduated from ...                ","link":"https://www.imdb.com/name/nm1706767?ref_=nmls_hd"},{"name":" Steve Martin","imgUrl":"https://m.media-amazon.com/images/M/MV5BNDY0ODYwNDM3OV5BMl5BanBnXkFtZTcwMTc3NjQzMg@@._V1_UY209_CR0,0,140,209_AL_.jpg","summary":"Steve Martin was born on August 14, 1945 in Waco, Texas, USA as Stephen Glenn Martin to Mary Lee (née Stewart; 1913-2002) and Glenn Vernon Martin (1914-1997), a real estate salesman and aspiring actor. He was raised in Inglewood and Garden Grove in California. In 1960, he got a job at the Magic ...                ","link":"https://www.imdb.com/name/nm0000188?ref_=nmls_hd"},{"name":" Seth Rogen","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTQ0NjgzNzcwNV5BMl5BanBnXkFtZTcwODExMDYxOQ@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"An actor, comedian and writer, Seth Rogen has come a long way from doing stand-up comedy as a teen.Rogen was born in Vancouver, British Columbia, to Sandy (Belogus), a social worker, and Mark Rogen, who worked for non-profits. His father is American-born and his mother is Canadian. He is of Russian...                ","link":"https://www.imdb.com/name/nm0736622?ref_=nmls_hd"},{"name":" Dan Aykroyd","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTI2MDA3NTg0NF5BMl5BanBnXkFtZTYwMzM5ODgz._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Daniel Edward Aykroyd was born on July 1, 1952 in Ottawa, Ontario, Canada, to Lorraine Hélène (Gougeon), a secretary from a French-Canadian family, and Samuel Cuthbert Peter Hugh Aykroyd, a civil engineer who advised prime minister Pierre Trudeau. Aykroyd attended Carleton University in 1969, where...                ","link":"https://www.imdb.com/name/nm0000101?ref_=nmls_hd"},{"name":" John Candy","imgUrl":"https://m.media-amazon.com/images/M/MV5BMzQ3MzQzODUxMF5BMl5BanBnXkFtZTcwMjY5MTkyOA@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Candy was one of Canada's greatest and funniest character actors. His well-known role as the big hearted buffoon earned him classics in Ha-Dod Buck (1989) and Planes, Trains & Automobiles (1987). His career has handed him some dry spells but Candy always rebounded.Born in Newmarket, Ontario, in...                ","link":"https://www.imdb.com/name/nm0001006?ref_=nmls_hd"},{"name":" Chevy Chase","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTMwNTY2ODA4OV5BMl5BanBnXkFtZTcwOTE1NjAxMw@@._V1_UY209_CR10,0,140,209_AL_.jpg","summary":"Chevy Chase was born Cornelius Crane Chase on October 8, 1943 in Lower Manhattan, New York, to Cathalene Parker (Browning), a concert pianist and librettist, and Edward Tinsley \"Ned\" Chase, an editor and writer. His parents both came from prominent families, and his grandfathers were artist and ...                ","link":"https://www.imdb.com/name/nm0000331?ref_=nmls_hd"},{"name":" Bill Murray","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTQ1OTM0MjEwOF5BMl5BanBnXkFtZTYwNTQwNzI1._V1_UY209_CR1,0,140,209_AL_.jpg","summary":"Bill Murray is an American actor, comedian, and writer. The fifth of nine children, he was born William James Murray in Wilmette, Illinois, to Lucille (Collins), a mailroom clerk, and Edward Joseph Murray II, who sold lumber. He is of Irish descent. Among his siblings are actors Brian Doyle-Murray, ...                ","link":"https://www.imdb.com/name/nm0000195?ref_=nmls_hd"},{"name":" Mike Myers","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTY0MTM1MTM5Nl5BMl5BanBnXkFtZTcwNzA1OTM3MQ@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Michael John Myers was born in 1963 in Scarborough, Ontario, to Alice E. (Hind), an officer supervisor, and Eric Myers, an insurance agent. His parents were both English, and had served in the Royal Air Force and British Army, respectively.Myers' television career really started in 1988, when he ...                ","link":"https://www.imdb.com/name/nm0000196?ref_=nmls_hd"},{"name":" Jack Black","imgUrl":"https://m.media-amazon.com/images/M/MV5BYTFiMWNlNmItMDRiYy00NzA4LWE5YjItZmViNWQ2NzhhOWZlXkEyXkFqcGdeQXVyMTA2Mjc5ODMy._V1_UY209_CR11,0,140,209_AL_.jpg","summary":"Jack Black was born Thomas Jacob Black in Santa Monica, California, to Judith Love (Cohen) and Thomas William Black, both satellite engineers. He is of British-German (father) and Russian Jewish (mother) ancestry. Black attended the University of California at Los Angeles. While at UCLA, he was a ...                ","link":"https://www.imdb.com/name/nm0085312?ref_=nmls_hd"},{"name":" Chris Rock","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTEyNjM5MjgyNzdeQTJeQWpwZ15BbWU3MDAzMzUyODc@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Christopher Julius Rock was born in Andrews, South Carolina and raised in Bedford-Stuyvesant, Brooklyn, New York. He is the son of Rosalie (Tingman), a teacher and social worker for the mentally handicapped, and Julius Rock, a truck driver and newspaper deliveryman, whose own father was a preacher....                ","link":"https://www.imdb.com/name/nm0001674?ref_=nmls_hd"},{"name":" Paul Rudd","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTY4NTEwNDg1MV5BMl5BanBnXkFtZTgwODMwMDA0ODE@._V1_UY209_CR13,0,140,209_AL_.jpg","summary":"Paul Stephen Rudd was born in Passaic, New Jersey. His parents, Michael and Gloria, both from Jewish families, were born in the London area, U.K. He has one sister, who is three years younger than he is. Paul traveled with his family during his early years, because of his father's airline job at ...                ","link":"https://www.imdb.com/name/nm0748620?ref_=nmls_hd"},{"name":" Chris Tucker","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTc4NjAxMjQwMF5BMl5BanBnXkFtZTYwMzcxOTg0._V1_UY209_CR6,0,140,209_AL_.jpg","summary":"At one point in time, Chris Tucker was the highest paid actor in Hollywood.Tucker was born in Atlanta, Georgia, to Mary Louise (Bryant) and Norris Tucker, who owned a janitorial service. After graduating from high school, Tucker made a change to move to Hollywood from Georgia to pursue a career in ...                ","link":"https://www.imdb.com/name/nm0000676?ref_=nmls_hd"},{"name":" David Spade","imgUrl":"https://m.media-amazon.com/images/M/MV5BMjA1NzQwNTkyN15BMl5BanBnXkFtZTYwMTIxNjQ3._V1_UY209_CR22,0,140,209_AL_.jpg","summary":"Adept at playing comic brat extraordinaires both on film and TV, David Spade was born on July 22, 1964, in Birmingham, Michigan, the youngest of three brothers. He is the son of Judith J. (Meek), a writer and editor, and Wayne M. Spade, a sales rep, and is of German, English, Irish, and Scottish ...                ","link":"https://www.imdb.com/name/nm0005450?ref_=nmls_hd"},{"name":" Chris O'Dowd","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTQ4MTQwNzk5NF5BMl5BanBnXkFtZTgwOTgzMDEwMTE@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Christopher \"Chris\" O'Dowd (born 9 October, 1979) is an Irish actor and comedian best known for his role as Roy Trenneman in the Channel 4 comedy The IT Crowd (2006). O'Dowd created and is starring in the Sky 1 television series Moone Boy (2012). He had a recurring role on the drama series Girls (...                ","link":"https://www.imdb.com/name/nm1483369?ref_=nmls_hd"},{"name":" Jason Segel","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTUwNzcxNzM1Nl5BMl5BanBnXkFtZTgwNzA5NzU4MjE@._V1_UY209_CR8,0,140,209_AL_.jpg","summary":"Multi-talented Jason Jordan Segel was born in Los Angeles, California, where he was raised by his parents, Jillian (Jordan), a homemaker, and Alvin Segel, a lawyer. His mother is of English, Scottish, and Irish ancestry, and his father is of Ashkenazi Jewish descent. He was educated at St. ...                ","link":"https://www.imdb.com/name/nm0781981?ref_=nmls_hd"},{"name":" Will Smith","imgUrl":"https://m.media-amazon.com/images/M/MV5BNTczMzk1MjU1MV5BMl5BanBnXkFtZTcwNDk2MzAyMg@@._V1_UY209_CR2,0,140,209_AL_.jpg","summary":"Willard Carroll \"Will\" Smith, Jr. (born September 25, 1968) is an American actor, comedian, producer, rapper, and songwriter. He has enjoyed success in television, film, and music. In April 2007, Newsweek called him \"the most powerful actor in Hollywood\". Smith has been nominated for five Golden ...                ","link":"https://www.imdb.com/name/nm0000226?ref_=nmls_hd"},{"name":" Russell Brand","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTUxMzA2Nzk0N15BMl5BanBnXkFtZTcwMDgwMTEwNQ@@._V1_UY209_CR3,0,140,209_AL_.jpg","summary":"Russell Brand was born on June 4, 1975, in Grays, Essex, England, the son of Barbara Elizabeth (Nichols) and Ronald Henry Brand, a photographer. An only child, his parents divorced when he was only six months old, and he was subsequently raised by his mother. Enduring a difficult childhood that saw...                ","link":"https://www.imdb.com/name/nm1258970?ref_=nmls_hd"},{"name":" Ricky Gervais","imgUrl":"https://m.media-amazon.com/images/M/MV5BMjQzOTEzMTk1M15BMl5BanBnXkFtZTgwODI1Mzc0MDI@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Ricky Dene Gervais was born in a suburb of Reading, Berkshire, to Eva Sophia (House) and Lawrence Raymond Gervais, who was a hod carrier and labourer. His father was born in Ontario, Canada, of French-Canadian descent, and his mother was English. He was educated at Ashmead Comprehensive School and ...                ","link":"https://www.imdb.com/name/nm0315041?ref_=nmls_hd"},{"name":" Neil Patrick Harris","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTUxNjQ4MjU5Ml5BMl5BanBnXkFtZTcwMTY5NzAzNw@@._V1_UY209_CR10,0,140,209_AL_.jpg","summary":"Neil Patrick Harris was born in Albuquerque, New Mexico, on June 15, 1973. His parents, Sheila Gail (Scott) and Ronald Gene Harris, were lawyers and ran a restaurant. He grew up in Ruidoso, New Mexico, a small town 120 miles south of Albuquerque, where he first took up acting in the fourth grade. ...                ","link":"https://www.imdb.com/name/nm0000439?ref_=nmls_hd"},{"name":" Vince Vaughn","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTQ1MDA0MzE0MF5BMl5BanBnXkFtZTYwOTUzOTI4._V1_UY209_CR5,0,140,209_AL_.jpg","summary":"Vincent Anthony Vaughn was born on March 28, 1970, in Minneapolis, Minnesota, USA, and was raised in Lake Forest, Illinois. His parents are Vernon Vaughn, a salesman and character actor, and Sharon Vaughn (née Sharon Eileen DePalmo), a real-estate agent and stockbroker. They divorced in 1991. He ...                ","link":"https://www.imdb.com/name/nm0000681?ref_=nmls_hd"},{"name":" Owen Wilson","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTgwMzQ4ODYxMV5BMl5BanBnXkFtZTcwNDAwMTc2NQ@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Self-proclaimed troublemaker Owen Cunningham Wilson was born in Dallas, to Irish-American parents originally from Massachusetts. He grew up in Texas with his mother, Laura (Cunningham), a photographer; his father, Robert Andrew Wilson, an ad exec; and his brothers, Andrew Wilson (the eldest) and ...                ","link":"https://www.imdb.com/name/nm0005562?ref_=nmls_hd"},{"name":" Rob Schneider","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTg0MDE4MTE0MF5BMl5BanBnXkFtZTcwOTYyOTM3MQ@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Robert Michael \"Rob\" Schneider (born October 31, 1963) is an American actor, comedian, screenwriter, and director. A stand-up comic and veteran of the NBC sketch comedy series Saturday Night Live (1975), Schneider has gone on to a successful career in feature films, including starring roles in the ...                ","link":"https://www.imdb.com/name/nm0001705?ref_=nmls_hd"},{"name":" Kevin Hart","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTY4OTAxMjkxN15BMl5BanBnXkFtZTgwODg5MzYyMTE@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Kevin Darnell Hart is an African-American comedian and actor who is known for his roles in the Jumanji sequels, Undeclared, Scary Movie 3, Think Like a Man, Ride Along, The Secret Life of Pets, Captain Underpants: The First Epic Movie, Central Intelligence and Hobbs & Shaw. He has 4 children from ...                ","link":"https://www.imdb.com/name/nm0366389?ref_=nmls_hd"},{"name":" Jim Parsons","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTg1MTkxODgzMF5BMl5BanBnXkFtZTgwMjExMjgyNzM@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Having grown up in Houston, and its northern suburb of Spring, he made his first stage appearance in a school play at the age of 6. Parsons then went on to study theater at the University of Houston. From there he won a place on a two-year Masters course in classical theater at the University of ...                ","link":"https://www.imdb.com/name/nm1433588?ref_=nmls_hd"},{"name":" Luke Wilson","imgUrl":"https://m.media-amazon.com/images/M/MV5BYWQ1MjM2M2QtMjE2OS00NGNhLTgyZWYtYzc5MDdjYzI5ZjViXkEyXkFqcGdeQXVyMTU3NTQyMTg@._V1_UY209_CR10,0,140,209_AL_.jpg","summary":"Handsome Texan Luke Cunningham Wilson was born in Dallas in 1971, to Irish-American parents originally from Massachusetts. The son of Laura (Cunningham), a photographer, and Robert Andrew Wilson, an advertising executive, he was raised with two brothers, Owen Wilson (the middle one) and Andrew ...                ","link":"https://www.imdb.com/name/nm0005561?ref_=nmls_hd"},{"name":" Sacha Baron Cohen","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTkzMTY4Nzc2NF5BMl5BanBnXkFtZTgwODc3MDI2MDE@._V1_UY209_CR8,0,140,209_AL_.jpg","summary":"British actor and comedian Sacha Baron Cohen was born in Hammersmith, London. He is the son of Daniella (Weiser), a movement instructor, and Gerald Baron Cohen, a clothing store owner. His father, born in England and raised in Wales, was of Eastern European Jewish descent, while his mother was born...                ","link":"https://www.imdb.com/name/nm0056187?ref_=nmls_hd"},{"name":" John Belushi","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTU5MDcwODczOV5BMl5BanBnXkFtZTYwMTk5NzM2._V1_UY209_CR11,0,140,209_AL_.jpg","summary":"John Belushi was born in Chicago, Illinois, USA, on January 24, 1949, to Agnes Demetri (Samaras) and Adam Anastos Belushi, a restaurant owner. His father was an Albanian immigrant, from Qytezë, and his mother was also of Albanian descent. He grew up in Wheaton, where the family moved when he was ...                ","link":"https://www.imdb.com/name/nm0000004?ref_=nmls_hd"},{"name":" Michael Cera","imgUrl":"https://m.media-amazon.com/images/M/MV5BNTgyNDgxMjUyOV5BMl5BanBnXkFtZTcwMDYxNzY1OQ@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Canadian actor Michael Cera was born in Brampton, Ontario, to parents who worked for Xerox. His mother, Linda, who is from Quebec, has English, Irish, Scottish, and Dutch ancestry, and his father, Luigi Cera, is Italian (from Sicily). Michael is the middle child between two sisters. He was educated...                ","link":"https://www.imdb.com/name/nm0148418?ref_=nmls_hd"},{"name":" Martin Lawrence","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTQ4NzIzMDAxMF5BMl5BanBnXkFtZTcwMDIyMTI2MQ@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Martin Fitzgerald Lawrence is an African-American comedian, producer, writer, director and actor. He is known for his roles in the Bad Boys trilogy, Martin, Def Comedy Jam, Big Momma's House, Open Season, House Party, Boomerang, Wild Hogs, What's Happening Now!!, Nothing to Lose, Life and Blue ...                ","link":"https://www.imdb.com/name/nm0001454?ref_=nmls_hd"},{"name":" Nick Frost","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTczNzA1ODc4Ml5BMl5BanBnXkFtZTgwNTA2MjkyNzM@._V1_UY209_CR6,0,140,209_AL_.jpg","summary":"Nick Frost is a Welsh actor, screenwriter and comedian. He is known for his work in the series of British comedic genre films The Three Flavours Cornetto trilogy: Shaun of the Dead (2004), Hot Fuzz (2007) and The World's End (2013). He also co-starred in Paul (2011), with frequent collaborator and ...                ","link":"https://www.imdb.com/name/nm0296545?ref_=nmls_hd"},{"name":" Rowan Atkinson","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTg3NDUzOTc3MV5BMl5BanBnXkFtZTcwNjcxMDkxNw@@._V1_UY209_CR0,0,140,209_AL_.jpg","summary":"Rowan Sebastian Atkinson was born on 6 January, 1955, in Consett, Co. Durham, UK, to Ella May (Bainbridge) and Eric Atkinson. His father owned a farm, where Rowan grew up with his two older brothers, Rupert and Rodney. He attended Newcastle University and Oxford University where he earned degrees ...                ","link":"https://www.imdb.com/name/nm0000100?ref_=nmls_hd"},{"name":" Billy Crystal","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTQ4MjA4MjM4NV5BMl5BanBnXkFtZTcwMzE0MjcxNQ@@._V1_UY209_CR7,0,140,209_AL_.jpg","summary":"Billy Crystal was born on March 14, 1948 in Manhattan, New York, and was raised on Long Island. He is the youngest of three sons born to Helen (Gabler) and Jack Crystal. His father was a well-known concert promoter who co-founded Commodore Records and his mother was a homemaker. His family were ...                ","link":"https://www.imdb.com/name/nm0000345?ref_=nmls_hd"},{"name":" Ken Jeong","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTk4MDM4NzI1MV5BMl5BanBnXkFtZTcwNjYyMDYzNw@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Ken Jeong is an American actor, comedian, and physician. He is known for his roles as Ben Chang on the critically acclaimed NBC/Yahoo! sitcom Community (2009) and gangster Leslie Chow in B'Derekh L'Khatunah Otzrim B'Vegas (2009) Trilogy. He appeared in Michael Bay's Revah u'khe'ev (2013), as Johnny...                ","link":"https://www.imdb.com/name/nm0421822?ref_=nmls_hd"},{"name":" Marlon Wayans","imgUrl":"https://m.media-amazon.com/images/M/MV5BNjllYWYxZTAtOTU5NC00MGJmLTgxN2ItOTdjYWE4NGZiYWY0XkEyXkFqcGdeQXVyMTExNzQzMDE0._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Marlon Wayans is an American actor, writer and comedian. He is known for playing Tyrone C. Love in Requiem for a Dream, Shorty Meeks from Scary Movie, Marcus Anthony Copeland II from White Chicks and Thunder from Marmaduke. He played Drake Winston/Robin in deleted scenes of Batman Returns and ...                ","link":"https://www.imdb.com/name/nm0005541?ref_=nmls_hd"},{"name":" Jason Sudeikis","imgUrl":"https://m.media-amazon.com/images/M/MV5BMjE3NTE4Nzg3Ml5BMl5BanBnXkFtZTgwODc5OTUxMTI@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Jason Sudeikis was born on September 18, 1975 in Fairfax, Virginia as Daniel Jason Sudeikis. His father is Daniel Joseph Sudeikis, a Vice President of a business development and his mother is Kathryn (née Wendt), a travel agent at Brennco and President of the American Society of Travel Agents. He ...                ","link":"https://www.imdb.com/name/nm0837177?ref_=nmls_hd"},{"name":" Jason Bateman","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTMwOTQ0MDUyNF5BMl5BanBnXkFtZTcwNTQ1MzY1Mw@@._V1_UY209_CR12,0,140,209_AL_.jpg","summary":"Jason Bateman is an American film and television actor, known for his role as Michael Bluth on the television sitcom Arrested Development (2003), as well as his role on Valerie (1986).He was born in Rye, New York. His father, Kent Bateman, from a Utah-based family, is a film and television director...                ","link":"https://www.imdb.com/name/nm0000867?ref_=nmls_hd"},{"name":" Aziz Ansari","imgUrl":"https://m.media-amazon.com/images/M/MV5BMjE5NzYwNDQwN15BMl5BanBnXkFtZTgwNDA2NjQwODE@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Aziz Ansari was born in Columbia, South Carolina, to Fatima, a medical office worker, and Shoukath, a gastroenterologist. His family is from Tamil Nadu, India. He graduated from NYU as a business major in 2004. He graduated from the South Carolina Governor's School for Math and Science in ...                ","link":"https://www.imdb.com/name/nm2106637?ref_=nmls_hd"},{"name":" Danny McBride","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTk5NTM0ODI4NF5BMl5BanBnXkFtZTcwNzg3MjY0Mg@@._V1_UY209_CR11,0,140,209_AL_.jpg","summary":"Danny McBride was born on December 29, 1976 in Statesboro, Georgia, USA as Daniel Richard McBride. He is a writer and actor, known for Pineapple Express (2008), Your Highness (2011) and Vice Principals (2016). He has been married to Gia Ruiz since October 9, 2010. They have one child.                ","link":"https://www.imdb.com/name/nm1144419?ref_=nmls_hd"},{"name":" James Franco","imgUrl":"https://m.media-amazon.com/images/M/MV5BMjA4MzMzNDM5MF5BMl5BanBnXkFtZTgwMjQ0MDk0NDM@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Known for his breakthrough starring role on Freaks and Geeks (1999), James Franco was born April 19, 1978 in Palo Alto, California, to Betsy Franco, a writer, artist, and actress, and Douglas Eugene \"Doug\" Franco, who ran a Silicon Valley business. His mother is Jewish and his father was of ...                ","link":"https://www.imdb.com/name/nm0290556?ref_=nmls_hd"},{"name":" Jimmy Fallon","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTk1MDIwOTg3OV5BMl5BanBnXkFtZTcwMjE3MjM3Mw@@._V1_UY209_CR5,0,140,209_AL_.jpg","summary":"Jimmy Fallon was born in 1974 in Brooklyn, New York, to Gloria (Feeley) and Jimmy Fallon. He is of Irish, German, and Norwegian descent. He was raised in Saugerties, New York, which is in upstate New York. He has performed stand up, impressions and characters across the country, in some of the ...                ","link":"https://www.imdb.com/name/nm0266422?ref_=nmls_hd"},{"name":" Terry Crews","imgUrl":"https://m.media-amazon.com/images/M/MV5BMjE1ODY0NzE4N15BMl5BanBnXkFtZTcwMTY5Mzk0Mw@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Terry Crews was born in Flint, Michigan, to Patricia and Terry Crews Sr. He earned an art excellence scholarship to attend Western Michigan University and also earned a full-ride athletic scholarship to play football. Crews was an All-Conference defensive end, and was a major contributor on the ...                ","link":"https://www.imdb.com/name/nm0187719?ref_=nmls_hd"},{"name":" Steve Buscemi","imgUrl":"https://m.media-amazon.com/images/M/MV5BODc0NTU3NDA4M15BMl5BanBnXkFtZTcwNDkxNzQxNA@@._V1_UY209_CR8,0,140,209_AL_.jpg","summary":"Steve Buscemi was born in Brooklyn, New York, to Dorothy (Wilson), a restaurant hostess, and John Buscemi, a sanitation worker. He is of Italian (father) and English, Dutch, and Irish (mother) descent. He became interested in acting during his last year of high school. After graduating, he moved to...                ","link":"https://www.imdb.com/name/nm0000114?ref_=nmls_hd"},{"name":" James Buckley","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTU1MzY4MzEyNV5BMl5BanBnXkFtZTcwMTA2NjcxNw@@._V1_UY209_CR0,0,140,209_AL_.jpg","summary":"James Buckley was born on August 14, 1987 in Croydon, England as James Patrick Buckley. He is an actor and producer, known for The Inbetweeners 2 (2014), Kru'im (2011) and Charlie kha'yav lamout (2013). He has been married to Clair Buckley since November 2, 2012. They have two children.                ","link":"https://www.imdb.com/name/nm0118617?ref_=nmls_hd"},{"name":" Simon Bird","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTM1MzA2MTgxN15BMl5BanBnXkFtZTcwMDY1NjcxNw@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Simon Bird was born on August 19, 1984 in Guildford, Surrey, England. He is an actor and director, known for The Inbetweeners 2 (2014), Kru'im (2011) and The Inbetweeners (2008). He has been married to Lisa Owens since 2012.                ","link":"https://www.imdb.com/name/nm3020713?ref_=nmls_hd"},{"name":" Blake Harrison","imgUrl":"https://m.media-amazon.com/images/M/MV5BOTk2N2RlMTAtNzg5OC00ZmVkLWE3NjYtNzllMDk5ZTdkYmFmXkEyXkFqcGdeQXVyMzYzMzczMDg@._V1_UY209_CR14,0,140,209_AL_.jpg","summary":"Blake attended the Brit School from 2003 and then the East 15 Acting School from 2007.Blake starred in three series and two subsequent films of the multi-award-winning comedy 'The Inbetweeners'.He also starred in the 2016 remake of 'Dad's Army' in which he played 'Private Pike'. His other film work...                ","link":"https://www.imdb.com/name/nm3002919?ref_=nmls_hd"},{"name":" Joe Thomas","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTc1OTMxMjc4Ml5BMl5BanBnXkFtZTcwMTY1NjcxNw@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Joe Thomas was born on October 28, 1983 in Chelmsford, Essex, England as Joseph Thomas. He is an actor and writer, known for Kru'im (2011), The Inbetweeners 2 (2014) and Chickens (2011).                ","link":"https://www.imdb.com/name/nm3022504?ref_=nmls_hd"},{"name":" Peter Kay","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTIxNjM2Nzg5OV5BMl5BanBnXkFtZTcwMzUyOTEyMQ@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"He was taught metal work at school by the actor Steve Coogan's dad, and like Coogan he was an altar boy. He proposed to his wife Susan on one knee outside 'Andy's Records', because it was the first place where they kissed. He's worked everywhere, in a factory packing toilet rolls, in a supermarket,...                ","link":"https://www.imdb.com/name/nm0443153?ref_=nmls_hd"},{"name":" Martin Short","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTY1MDIyMDY1N15BMl5BanBnXkFtZTgwNzMzMDE5NTE@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Martin Short was born on March 26, 1950 in Hamilton, Ontario, Canada as Martin Hayter Short. He is an actor and writer, known for Yom B'Malkodet (1987), The Santa Clause 3: The Escape Clause (2006) and Midot raot (2014). He was previously married to Nancy Dolman.                ","link":"https://www.imdb.com/name/nm0001737?ref_=nmls_hd"},{"name":" Christopher Mintz-Plasse","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTQyNjUzMDk5N15BMl5BanBnXkFtZTcwNzk0Nzk5Mw@@._V1_UY209_CR7,0,140,209_AL_.jpg","summary":"Christopher Mintz-Plasse is an American actor, drummer and comedian who is widely known for playing McLovin from the hit high school comedy film Superbad. He also played Fishlegs from How to Train Your Dragon, Augie Farcques from Role Models, Giuseppe from Marmaduke, Chris D'Amico from Kick-Ass, ...                ","link":"https://www.imdb.com/name/nm2395586?ref_=nmls_hd"},{"name":" Charlie Sheen","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTIyNDQ5Nzk2OF5BMl5BanBnXkFtZTcwODU4MTU5MQ@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Charlie Sheen was born Carlos Irwin Estévez on September 3, 1965, in New York City. His father, actor Martin Sheen (born Ramon Antonio Gerard Estevez), was at the time just breaking into the business, with performances on Broadway. His mother, Janet Sheen (née Templeton), was a former New York art ...                ","link":"https://www.imdb.com/name/nm0000221?ref_=nmls_hd"},{"name":" Tim Allen","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTI5ODY0NTAwOF5BMl5BanBnXkFtZTcwOTI3NjQxMw@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Timothy Allen Dick was born on June 13, 1953, in Denver, Colorado, to Martha Katherine (Fox) and Gerald M. Dick. His father, a real estate salesman, was killed in a collision with a drunk driver while driving his family home from a University of Colorado football game, when Tim was eleven years old...                ","link":"https://www.imdb.com/name/nm0000741?ref_=nmls_hd"},{"name":" Andy Samberg","imgUrl":"https://m.media-amazon.com/images/M/MV5BNDg3NDk3ODI0Ml5BMl5BanBnXkFtZTgwOTE3MTE4NTM@._V1_UY209_CR5,0,140,209_AL_.jpg","summary":"Andy Samberg was born in Berkeley, California, to Marjorie (Marrow), a teacher, and Joe Samberg, a photographer. With Jorma Taccone and Akiva Schaffer, Samberg is one of three Los Angeles, California-based writer-performer-filmmakers--all childhood friends--dubbed The Lonely Island, whose short ...                ","link":"https://www.imdb.com/name/nm1676221?ref_=nmls_hd"},{"name":" Seann William Scott","imgUrl":"https://m.media-amazon.com/images/M/MV5BMjEzMjk1NTA1Ml5BMl5BanBnXkFtZTcwNjQyNjAwOQ@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Seann William Scott was born in Cottage Grove, Minnesota, to Patricia Anne (Simons) and William Frank Scott, a factory worker. He was discovered at a talent competition in Los Angeles, and almost immediately was flown to New York by ABC to test for All My Children (1970). His face has also been ...                ","link":"https://www.imdb.com/name/nm0005405?ref_=nmls_hd"},{"name":" Jason Biggs","imgUrl":"https://m.media-amazon.com/images/M/MV5BMjAzMTM0NzkwM15BMl5BanBnXkFtZTcwMDQwMjU0NA@@._V1_UY209_CR13,0,140,209_AL_.jpg","summary":"Jason Matthew Biggs was born on May 12, 1978, in Pompton Plains, New Jersey, to Angela (Zocco), a nurse, and Gary Biggs, a shipping company manager. Jason has two sisters, Heather, a tax specialist born in 1971, and Chiara, born in 1980. He was raised Catholic, and is of English and mostly Italian ...                ","link":"https://www.imdb.com/name/nm0004755?ref_=nmls_hd"},{"name":" Robert Downey Jr.","imgUrl":"https://m.media-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Robert Downey Jr. has evolved into one of the most respected actors in Hollywood. With an amazing list of credits to his name, he has managed to stay new and fresh even after over four decades in the business.Downey was born April 4, 1965 in Manhattan, New York, the son of writer, director and ...                ","link":"https://www.imdb.com/name/nm0000375?ref_=nmls_hd"},{"name":" Eugene Levy","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTM0NTQ5NjA3Ml5BMl5BanBnXkFtZTYwMDgwMjQ1._V1_UY209_CR4,0,140,209_AL_.jpg","summary":"Eugene Levy is an award-winning actor, writer, and producer. He has appeared in more than 60 motion pictures to date, eight of which having topped the $100M mark. The box office success of films such as Bringing Down the House (2003), Cheaper by the Dozen 2 (2005) , and Avi Ha-Kala 2 (1995) have ...                ","link":"https://www.imdb.com/name/nm0506405?ref_=nmls_hd"},{"name":" John Lithgow","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTQzMzUyNDkzNF5BMl5BanBnXkFtZTcwNTMwNTU5MQ@@._V1_UY209_CR13,0,140,209_AL_.jpg","summary":"If \"born to the theater\" has meaning in determining a person's life path, then John Lithgow is a prime example of this truth. He was born in Rochester, New York, to Sarah Jane (Price), an actress, and Arthur Washington Lithgow III, who was both a theatrical producer and director. John's father was ...                ","link":"https://www.imdb.com/name/nm0001475?ref_=nmls_hd"},{"name":" Jay Baruchel","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTM5MjY0MzU0OV5BMl5BanBnXkFtZTcwOTE0NDA2NA@@._V1_UY209_CR7,0,140,209_AL_.jpg","summary":"Jay Baruchel was born in Ottawa, Ontario, and was raised in Montreal, Quebec, Canada. He is the son of Robyne (Ropell), a freelance writer, and Serge Victor Baruchel, an antiques dealer. He has a younger sister who also acts. He started acting in 1995 when he made his first of three appearances on ...                ","link":"https://www.imdb.com/name/nm0059431?ref_=nmls_hd"},{"name":" Leslie Nielsen","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTI3MTE1NjM4N15BMl5BanBnXkFtZTYwNzI3MTI0._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Leslie William Nielsen was born in Regina, Saskatchewan, and raised in Tulita (formerly Fort Norman), Northwest Territories. His mother, Mabel Elizabeth (Davies), was Welsh. His father, Ingvard Eversen Nielsen, was a Danish-born Mountie and a strict disciplinarian. Leslie studied at the Academy of ...                ","link":"https://www.imdb.com/name/nm0000558?ref_=nmls_hd"},{"name":" Eric Idle","imgUrl":"https://m.media-amazon.com/images/M/MV5BNzY4NTQwNDA4M15BMl5BanBnXkFtZTYwNTg5Njcz._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Eric Idle is an English comedian, actor, author, singer, playwright, director, and songwriter. co-creator of Monty Python on TV, stage, and five films, including The Life of Brian and The Holy Grail, which he later adapted for the stage with John Du Prez as Monty Python's Spamalot, winning the Tony...                ","link":"https://www.imdb.com/name/nm0001385?ref_=nmls_hd"},{"name":" Craig Robinson","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTU4MjIyMTU2Nl5BMl5BanBnXkFtZTcwMzExODEyMw@@._V1_UY209_CR20,0,140,209_AL_.jpg","summary":"Craig Robinson is an African-American actor, singer, musician and comedian who is known for portraying Darryl Philbin from The Office, LeVar Brown from The Cleveland Show, Doug Judy from Brooklyn Nine-Nine, Cookie from Shrek Forever After, himself from This Is The End, and Nick Webber-Agnew from ...                ","link":"https://www.imdb.com/name/nm0732497?ref_=nmls_hd"},{"name":" Nick Swardson","imgUrl":"https://m.media-amazon.com/images/M/MV5BMjQ5NDYzMTM5Nl5BMl5BanBnXkFtZTcwNjM0NDkwNg@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Nick Swardson was born on October 9, 1976 in Minneapolis, Minnesota, USA as Nicholas Swardson. He is an actor and writer, known for Grandma's Boy (2006), The Benchwarmers (2006) and Just Go with It (2011).                ","link":"https://www.imdb.com/name/nm0841910?ref_=nmls_hd"},{"name":" Richard Pryor","imgUrl":"https://m.media-amazon.com/images/M/MV5BMjA1NzUzMTIzNF5BMl5BanBnXkFtZTcwNTM5ODAyMw@@._V1_UY209_CR13,0,140,209_AL_.jpg","summary":"Highly influential, and always controversial, African-American actor/comedian who was equally well known for his colorful language during his live comedy shows, as for his fast paced life, multiple marriages and battles with drug addiction. He has been acknowledged by many modern comic artist's as ...                ","link":"https://www.imdb.com/name/nm0001640?ref_=nmls_hd"},{"name":" Peter Sellers","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTI0MjE1MjczMF5BMl5BanBnXkFtZTYwMDIxNTQ2._V1_UY209_CR15,0,140,209_AL_.jpg","summary":"Often credited as the greatest comedian of all time, Peter Sellers was born Richard Henry Sellers to a well-off acting family in 1925 in Southsea, a suburb of Portsmouth. He was the son of Agnes Doreen \"Peg\" (Marks) and William \"Bill\" Sellers. His parents worked in an acting company run by his ...                ","link":"https://www.imdb.com/name/nm0000634?ref_=nmls_hd"},{"name":" David Walliams","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTUzNDI1MjQ5OV5BMl5BanBnXkFtZTgwNjA4NDkzODE@._V1_UY209_CR5,0,140,209_AL_.jpg","summary":"David Walliams was born on August 20, 1971 in Banstead, Surrey, England as David Edward Williams. He is an actor and writer, known for Little Britain (2003), Run Fatboy Run (2007) and Dinner for Schmucks (2010). He was previously married to Lara Stone.                ","link":"https://www.imdb.com/name/nm0909144?ref_=nmls_hd"},{"name":" Matt LeBlanc","imgUrl":"https://m.media-amazon.com/images/M/MV5BODQ0NTI0OTk0M15BMl5BanBnXkFtZTcwMDk2MDg5Nw@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Matt LeBlanc was born on 25 July 1967 in Newton, Massachussetts. His mother, Patricia, is of Italian origin, and worked as an office manager, and his father, Paul LeBlanc, who was from a French-Canadian family, was a mechanic. After graduating from high school, he spent some time as a photo model ...                ","link":"https://www.imdb.com/name/nm0001455?ref_=nmls_hd"},{"name":" Matthew Perry","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTMwODc5NjI3N15BMl5BanBnXkFtZTcwNDEyMTE3Mw@@._V1_UY209_CR12,0,140,209_AL_.jpg","summary":"Matthew Perry was born in Williamstown, Massachusetts, to Suzanne Marie (Langford), a Canadian journalist, and John Bennett Perry, an American actor. His ancestry includes English, Irish, German, Swiss-German, and French-Canadian.Perry was raised in Ottawa, Ontario, where he became a top-ranked ...                ","link":"https://www.imdb.com/name/nm0001612?ref_=nmls_hd"},{"name":" Bill Hader","imgUrl":"https://m.media-amazon.com/images/M/MV5BNTY3MzgwMjE3N15BMl5BanBnXkFtZTcwNjc2MjE3NA@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Bill Hader is an American comedian and actor who is known for playing in Saturday Night Live from 2005 to 2013. He created and starred in the HBO show Barry. He also played Flint Lockwood from Cloudy with a Chance of Meatballs, Colonel Custer from Night at the Museum 2, Fear from Inside Out and ...                ","link":"https://www.imdb.com/name/nm0352778?ref_=nmls_hd"},{"name":" Rick Moranis","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTY5MTM4NTY0OF5BMl5BanBnXkFtZTcwMjA0NTgwMw@@._V1_UY209_CR30,0,140,209_AL_.jpg","summary":"Rick began his career as a radio DJ while he was still at high school which led to him writing, producing and being on air in his own show. He joined the Canadian TV series, Second City TV (1976), winning an Emmy for writing and portraying the character, Bob McKenzie, which became the basis for the ...                ","link":"https://www.imdb.com/name/nm0001548?ref_=nmls_hd"},{"name":" Jon Heder","imgUrl":"https://m.media-amazon.com/images/M/MV5BNDA0MjY5NTA1OV5BMl5BanBnXkFtZTcwOTk3Mjg4Mw@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Jonathan Joseph Heder is an American actor and producer who is known for portraying Napoleon Dynamite. He returned to play the role in an animated series and a 2005 MTV Movie Awards skit. He also acted in Surf's Up, Just Like Heaven, Pinocchio, The Benchwarmers, Blades of Glory, Monster House, ...                ","link":"https://www.imdb.com/name/nm1417647?ref_=nmls_hd"},{"name":" David Koechner","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTcwODM1MjExNV5BMl5BanBnXkFtZTgwMzY2ODg2MDE@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Actor, writer and producer David Michael Koechner was born in Tipton, Missouri, to Margaret Ann (Downey) and Cecil Stephen Koechner, who ran a turkey coop manufacturing business. He is of German, Irish, and English ancestry. An alumnus of Chicago's Second City Theater, Koechner got his first break ...                ","link":"https://www.imdb.com/name/nm0462712?ref_=nmls_hd"},{"name":" Will Arnett","imgUrl":"https://m.media-amazon.com/images/M/MV5BZTgxNDdlYjAtNGQzZC00ODJlLTliYjYtYTk0ZDE4YTBmYmM0XkEyXkFqcGdeQXVyNDc1NDA0NA@@._V1_UY209_CR11,0,140,209_AL_.jpg","summary":"Will Arnett is a Canadian-American actor, voice actor, and comedian. His most famous for playing George Oscar \"Gob\" Bluth II in the Fox series Arrested Development (2003). He also appeared in films, such as Seret Lego (2014), Tzabei ha'Ninja (2014), Tzabei ha'Ninja: yotz'im me'ha'tzlalim (2016), ...                ","link":"https://www.imdb.com/name/nm0004715?ref_=nmls_hd"},{"name":" Ice Cube","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTYyMTE0NDQwMV5BMl5BanBnXkFtZTcwMDA1NjA1Nw@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Ice Cube was born in South Central Los Angeles, to Doris (Benjamin), a custodian and hospital clerk, and Hosea Jackson, a UCLA groundskeeper. He first came to public notice as a singer and songwriter with the controversial and influential band N.W.A. His compositions with that group included many ...                ","link":"https://www.imdb.com/name/nm0001084?ref_=nmls_hd"},{"name":" Shawn Wayans","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTU5MTY2MzI0NV5BMl5BanBnXkFtZTcwMDQ0NjM0OA@@._V1_UY209_CR6,0,140,209_AL_.jpg","summary":"Shawn Wayans was born on January 19, 1971 in New York City, New York, USA as Shawn M. Wayans. He is an actor and writer, known for White Chicks (2004), Don't Be a Menace to South Central While Drinking Your Juice in the Hood (1996) and Little Man (2006).                ","link":"https://www.imdb.com/name/nm0915465?ref_=nmls_hd"},{"name":" Michael Palin","imgUrl":"https://m.media-amazon.com/images/M/MV5BNTQ5OTMyMzQ2MF5BMl5BanBnXkFtZTcwMTk5MzAxMw@@._V1_UY209_CR75,0,140,209_AL_.jpg","summary":"Michael Palin is an English comedian, actor, writer and television presenter. He was one of the members of the comedy group Monty Python.After the Monty Python television series ended in 1974, the Palin/Jones team worked on Ripping Yarns, an intermittent television comedy series broadcast over ...                ","link":"https://www.imdb.com/name/nm0001589?ref_=nmls_hd"},{"name":" Graham Chapman","imgUrl":"https://m.media-amazon.com/images/M/MV5BMjAzODAyODc4NF5BMl5BanBnXkFtZTcwODY5MzAxMw@@._V1_UY209_CR73,0,140,209_AL_.jpg","summary":"Graham Chapman was born on January 8, 1941 in Leicester, England while a German air raid was in progress. Graham's father was a chief police inspector and probably inspired the constables Graham often portrayed later in comedy sketches. Graham studied medicine in college and earned an M.D., but he ...                ","link":"https://www.imdb.com/name/nm0001037?ref_=nmls_hd"},{"name":" Terry Jones","imgUrl":"https://m.media-amazon.com/images/M/MV5BYjdjODRlMDQtNjEzNS00MDI4LWFjMWItZDdmZWYzMzJkM2I4XkEyXkFqcGdeQXVyMjE5MzM3MjA@._V1_UY209_CR12,0,140,209_AL_.jpg","summary":"Terry Jones was born in Colwyn Bay, North Wales, the son of Dilys Louisa (Newnes), a homemaker, and Alick George Parry Jones, a bank clerk. His older brother is production designer Nigel Jones. His grandparents were involved in the entertainment business, having managed the local Amateur Operatic ...                ","link":"https://www.imdb.com/name/nm0001402?ref_=nmls_hd"},{"name":" Terry Gilliam","imgUrl":"https://m.media-amazon.com/images/M/MV5BODAyMDM0NjEwOF5BMl5BanBnXkFtZTcwMTUyMDY5Mg@@._V1_UY209_CR9,0,140,209_AL_.jpg","summary":"Terry Gilliam was born near Medicine Lake, Minnesota. When he was 12 his family moved to Los Angeles where he became a fan of MAD magazine. In his early twenties he was often stopped by the police who suspected him of being a drug addict and Gilliam had to explain that he worked in advertising. In ...                ","link":"https://www.imdb.com/name/nm0000416?ref_=nmls_hd"},{"name":" Brendan O'Carroll","imgUrl":"https://m.media-amazon.com/images/M/MV5BMjI0MDM2NTU4NF5BMl5BanBnXkFtZTcwNzExMjI0Nw@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Brendan O'Carroll was born on September 15, 1955 in Dublin, Ireland. He is a writer and actor, known for Mrs. Brown's Boys (2011), Mrs. Brown's Boys D'Movie (2014) and Mrs. Brown's Boys: The Original Series (2002). He has been married to Jennifer Gibney since August 1, 2005. He was previously ...                ","link":"https://www.imdb.com/name/nm0639983?ref_=nmls_hd"},{"name":" Rob Riggle","imgUrl":"https://m.media-amazon.com/images/M/MV5BMjA4MDc5MzI5N15BMl5BanBnXkFtZTgwMDMzODc3NjE@._V1_UY209_CR34,0,140,209_AL_.jpg","summary":"Comedian, actor and United States Marine Corps Reserve Lieutenant Colonel Robert Allen Riggle, Jr. was born April 21, 1970 in Louisville, Kentucky, to Sandra (Shrout) and Robert Allen Riggle, who worked in insurance. Riggle has amassed notable television credits and has also earned roles in many ...                ","link":"https://www.imdb.com/name/nm1443527?ref_=nmls_hd"},{"name":" Richard Ayoade","imgUrl":"https://m.media-amazon.com/images/M/MV5BMjE0MDIzMDM4Nl5BMl5BanBnXkFtZTcwODc4MzczNA@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Richard Ellef Ayoade was born in Hammersmith, and grew up in Suffolk, in England, the son of a Norwegian mother, Dagny Amalie (Baassuik), and a Nigerian father, Layide Ade Laditi Ayoade. He studied Law at Cambridge university, and followed in the footsteps of British Comedy legends like Monty ...                ","link":"https://www.imdb.com/name/nm1547964?ref_=nmls_hd"},{"name":" Kenan Thompson","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTc5NzQ4MjY4MV5BMl5BanBnXkFtZTYwMjcyNTM1._V1_UY209_CR0,0,140,209_AL_.jpg","summary":"Kenan Thompson was born on May 10, 1978 in Atlanta, Georgia, USA as Kenan Stacy Thompson. He is an actor and producer, known for Saturday Night Live (1975), Snakes on a Plane (2006) and Good Burger (1997). He has been married to Christina Evangeline since November 11, 2011. They have two children.                ","link":"https://www.imdb.com/name/nm0860380?ref_=nmls_hd"},{"name":" Kel Mitchell","imgUrl":"https://m.media-amazon.com/images/M/MV5BODBhYzU0NDAtNTVlOC00NDc1LThiYmYtODI4NjA2OTg4ZGQ1XkEyXkFqcGdeQXVyMjQ3NTExNjM@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Acting Career - Hailing from the Windy City, Kel Mitchell began his acting career at the young age of 12 with the ETA Creative Arts Foundation. Young Kel wowed audiences with his on-stage performances in Chicago theatrical productions such as \"Kasimu & the Coconut Palm\" and \"Dirt.\" But it was his ...                ","link":"https://www.imdb.com/name/nm0005239?ref_=nmls_hd"},{"name":" Drake Bell","imgUrl":"https://m.media-amazon.com/images/M/MV5BNjA1NDQyNzA4NV5BMl5BanBnXkFtZTgwMjAxMDU3MTE@._V1_UY209_CR6,0,140,209_AL_.jpg","summary":"Drake Bell was born on June 27, 1986 in Santa Ana, California, USA as Jared Drake Bell. He is an American actor, singer, songwriter, and musician. He is also known as Drake Campana, under which name he records Spanish-language songs. In December 2005 Bell was driving a vehicle that was stopped at a...                ","link":"https://www.imdb.com/name/nm0068166?ref_=nmls_hd"},{"name":" Josh Peck","imgUrl":"https://m.media-amazon.com/images/M/MV5BZGIzZDcwMDEtMjNiZS00ODkwLTkxMWMtMDE3N2EyYmM5ZjBjXkEyXkFqcGdeQXVyMTI2Nzk2MjQ1._V1_UY209_CR14,0,140,209_AL_.jpg","summary":"Josh Peck was born on November 10, 1986 in New York City, New York, USA as Joshua Michael Peck. He is known for his work on Mean Creek (2004), Drake & Josh (2004) and The Wackness (2008). He has been married to Paige O'Brien since June 19, 2017. They have one child.                ","link":"https://www.imdb.com/name/nm0669681?ref_=nmls_hd"},{"name":" Seth MacFarlane","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTgyNDk3OTI2NF5BMl5BanBnXkFtZTcwMDA4NjU5OA@@._V1_UY209_CR1,0,140,209_AL_.jpg","summary":"Seth Woodbury MacFarlane was born in the small New England town of Kent, Connecticut, where he lived with his mother, Ann Perry (Sager), an admissions office worker, his father, Ronald Milton MacFarlane, a prep school teacher, and his sister, Rachael MacFarlane, now a voice actress and singer. He ...                ","link":"https://www.imdb.com/name/nm0532235?ref_=nmls_hd"},{"name":" Ed Helms","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTk2MDQwODEwNV5BMl5BanBnXkFtZTcwNjc4MTY0NA@@._V1_UY209_CR12,0,140,209_AL_.jpg","summary":"Ed Helms was born on January 24, 1974 in Atlanta, Georgia, USA as Edward Parker Helms. He is an actor and producer, known for B'Derekh L'Khatunah Otzrim B'Vegas (2009), The Office (2005) and Khoufsha be'hafra'a (2015).                ","link":"https://www.imdb.com/name/nm1159180?ref_=nmls_hd"},{"name":" Chris Farley","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTQwMjQwODkxMl5BMl5BanBnXkFtZTYwMTAxNjc1._V1_UY209_CR2,0,140,209_AL_.jpg","summary":"Christopher Crosby Farley was born on February 15, 1964, in Madison, Wisconsin, to Mary Anne (Crosby) and Thomas Farley, who owned an oil company. Among his siblings are actors Kevin P. Farley and John Farley. He was of Irish heritage. Farley studied theatre and communications on Marquette ...                ","link":"https://www.imdb.com/name/nm0000394?ref_=nmls_hd"},{"name":" Hank Azaria","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTQ0MzIxMzUwMV5BMl5BanBnXkFtZTcwMjE1NjM1Mg@@._V1_UY209_CR3,0,140,209_AL_.jpg","summary":"Hank Azaria was born on April 25, 1964 in Queens, New York City, New York, USA as Henry Albert Azaria. He is an actor and producer, known for The Simpsons (1989), Free Agents (2011) and The Birdcage (1996). He was previously married to Helen Hunt.                ","link":"https://www.imdb.com/name/nm0000279?ref_=nmls_hd"},{"name":" Jerry Seinfeld","imgUrl":"https://m.media-amazon.com/images/M/MV5BMTYxMDkwMjM5NV5BMl5BanBnXkFtZTcwMzUxMTgxNw@@._V1_UX140_CR0,0,140,209_AL_.jpg","summary":"Jerry Seinfeld was born in Brooklyn, New York, the son of Betty (Hesney) and Kalman Seinfeld. His father was of Hungarian Jewish descent, while Jerry's maternal grandparents, Salha and Selim Hosni, were Syrian Jewish immigrants (from Aleppo). He moved with his family, including sister Carolyn, to ...                ","link":"https://www.imdb.com/name/nm0000632?ref_=nmls_hd"}]